Update README UI docs
